raibisch/ESP32_ABL/src/main.cpp
/* ------------------until now not used--------------------------
static String ByteToAscii(byte input) 
{
  char singleChar, out;
  char asciiString[2+1] {0,0,0}; 
  sprintf(asciiString, "%2X", input);
  return String(asciiString);
}

char ByteToAscii(const char *input) 
{
  char singleChar, out;
  memcpy(&singleChar, input, 2);
  sprintf(&out, "%c", (int)strtol(&singleChar, NULL, 16));
  return out;
}

static byte calculateLRC(String s)
{
    byte LRC = 0;
    for (int i = 0; i < s.length(); i++)
    {
        LRC ^= (byte)s[i];
    }
    return LRC;
}
---------------------------not used -------------------------*/


////////////////////////////////////////////
/// @brief init builtin LED
////////////////////////////////////////////
void initLED()
{
#ifndef WITHOUT_LED
  pinMode(LED_GPIO, OUTPUT);
  digitalWrite(LED_GPIO, HIGH);
#endif
}

/// @brief  set builtin LED
/// @param i = HIGH / LOW
void setLED(uint8_t i)
{
   debug_printf("LED light %d\r\n", i);
#ifndef WITHOUT_LED
  digitalWrite(LED_GPIO, i);
#endif
}


//////////////////////////////////////////////////////
/// @brief  expand Class "FileVarStore" with variables
//////////////////////////////////////////////////////
class ABL_FileVarStore : public FileVarStore
{
 public:  
  // Device-Parameter
   String varDEVICE_s_Name  = "Wallbox";

   // ABL-Parameter
   uint16_t varABL_i_A_soll_high = 14;
   uint16_t varABL_i_A_soll_low  = 6;
   uint16_t varABL_i_U_netz = 230;
   uint32_t varABL_i_Scantime_ms = 30000;
   uint32_t varABL_i_logtime_ms  = 1000;
   uint16_t varABL_i_Watt_16A;
   uint16_t varABL_i_Watt_12A;
   uint16_t varABL_i_Watt_10A;
   uint16_t varABL_i_Watt_08A;
   uint16_t varABL_i_Watt_06A;

  // Wifi-Parameter
   String varWIFI_s_Mode    = "STA"; // STA=client connect with Router,  AP=Access-Point-Mode (needs no router)
   String varWIFI_s_Password= "mypassword";
   String varWIFI_s_SSID    = "myssid";

#ifdef MQTT_ENABLE
  uint16_t varMQTT_i_PORT = 1883; 
  String varMQTT_s_HOST = "192.168.2.22";
  String varMQTT_s_USER = "";
  String varMQTT_s_PASS = "";
  String varMQTT_s_TOPIC_OUT   = "abl/out/";
  String varMQTT_s_PAYLOAD_OUT ="{\"status\":%s, \"ipm\":%d, \"kw\":%d, \"kwh\":%d, \"whsum\":%d}"; // change to whatever you want !
  String varMQTT_s_TOPIC_IN    ="abl/in/"; // requested payload: {"imax":<value>}  e.g. {"imax:12}
#endif
     

 protected:
   void GetVariables()
   {
     varDEVICE_s_Name     = GetVarString(GETVARNAME(varDEVICE_s_Name));
     varWIFI_s_Mode       = GetVarString(GETVARNAME(varWIFI_s_Mode)); //STA or AP
     varWIFI_s_Password   = GetVarString(GETVARNAME(varWIFI_s_Password));
     varWIFI_s_SSID       = GetVarString(GETVARNAME(varWIFI_s_SSID));

     varABL_i_U_netz      = GetVarInt(GETVARNAME(varABL_i_U_netz));
     varABL_i_A_soll_low  = GetVarInt(GETVARNAME(varABL_i_A_soll_low));
     varABL_i_A_soll_high = GetVarInt(GETVARNAME(varABL_i_A_soll_high),16);
     varABL_i_Scantime_ms = GetVarInt(GETVARNAME(varABL_i_Scantime_ms),30000);  

     varABL_i_Watt_16A    = GetVarInt(GETVARNAME(varABL_i_Watt_16A),(230*2*16));
     varABL_i_Watt_12A    = GetVarInt(GETVARNAME(varABL_i_Watt_12A),(230*2*12));
     varABL_i_Watt_10A    = GetVarInt(GETVARNAME(varABL_i_Watt_10A),(230*2*10));
     varABL_i_Watt_08A    = GetVarInt(GETVARNAME(varABL_i_Watt_08A),(230*2*8));
     varABL_i_Watt_06A    = GetVarInt(GETVARNAME(varABL_i_Watt_06A),(230*2*6));
#ifdef MQTT_ENABLE
     varMQTT_i_PORT       = GetVarInt(GETVARNAME(varMQTT_i_PORT),1883);
     varMQTT_s_HOST       = GetVarString(GETVARNAME(varMQTT_s_HOST)); 
     varMQTT_s_USER       = GetVarString(GETVARNAME(varMQTT_s_USER)); 
     varMQTT_s_PASS       = GetVarString(GETVARNAME(varMQTT_s_PASS));
     varMQTT_s_TOPIC_OUT  = GetVarString(GETVARNAME(varMQTT_s_TOPIC_OUT));
     varMQTT_s_PAYLOAD_OUT= GetVarString(GETVARNAME(varMQTT_s_PAYLOAD_OUT));
     varMQTT_s_TOPIC_IN   = GetVarString(GETVARNAME(varMQTT_s_TOPIC_IN));
#endif  

   }
};
ABL_FileVarStore varStore;

bool initFileVarStore()
{
  return varStore.Load();
}



/// @brief do not wait for next polling periode
static void forcePolling()
{
      ABL_PollTime_old  = 0;
}

 
#ifdef MQTT_ENABLE
// Generate MQTT client instance
// N.B.: Default message buffer size is too small!
MQTTClient mqttclient(MQTT_PAYLOAD_SIZE);

void mqtt_messageReceived(String &topic, String &payload) 
{
  // Note: Do not use the client in the callback to publish, subscribe or
  // unsubscribe as it may cause deadlocks when other things arrive while
  // sending and receiving acknowledgments. Instead, change a global variable,
  // or push to a queue and handle it in the loop after calling `client.loop()`.
   debug_println("* MQTT: incoming: " + topic + " - " + payload);
   
   uint a = payload.substring(8,9).toInt();
   AsyncWebLog.println("MQTT SET-Imax:" + String(a)+ "A");
   if ((a >=6 && a <=16) || (a==0))
   {
      forcePolling();
      ABL_tx_Icmax = a;
      ABL_tx_status = SET_Current; // next Send Protocol
   }
   else
   {
      AsyncWebLog.println("**ERROR Imax out of range!");
   }
  ABL_tx_Icmax = payload.toInt();
}


/// @brief setup MQTT-client
void mqtt_setup()
{
  debug_println("* MQTT: connecting... ");
  mqttclient.begin(varStore.varMQTT_s_HOST.c_str(), varStore.varMQTT_i_PORT, client);
  mqttclient.onMessage(mqtt_messageReceived);
  while (!mqttclient.connect(MQTT_CLIENTID, varStore.varMQTT_s_USER.c_str(), varStore.varMQTT_s_PASS.c_str()))
  {
        Serial.print(".");
        delay(1000);
  }
  debug_println("* MQTT: connected!");

  debug_printf("* MQTT suscribe %s\r\n", varStore.varMQTT_s_TOPIC_IN);
  mqttclient.subscribe(varStore.varMQTT_s_TOPIC_IN);
}

/// @brief  MQTT run in loop()
inline void mqtt_loop()
{
    mqttclient.loop();
    delay(10);  // <- fixes some issues with WiFi stability

    if (!mqttclient.connected()) 
    {
      mqtt_setup();
    }
    char str[80] = {};
    // cheat: '%' in config.txt is replaces with '&' because web-edit does not allow % in string.  (varStore 'GetVarString' function does replace)
    // in config.txt:  varMQTT_s_PAYLOAD_OUT  ={"status":"&s", "ipm":&d, "w":&d, "wh":&d, "whsum":&d};
    // result -->                          str={"status":"%s", "ipm":%d, "w":%d, "wh":%d, "whsum":%d}
    // change if you want an other output !
    // ... or add more single publish messages for DOMOTICZ
    sprintf(str, varStore.varMQTT_s_PAYLOAD_OUT.c_str(), ABL_rx_status, ABL_rx_Ipwm, (int)(ABL_rx_kW*1000.0), (int)ABL_rx_Wh, (int)ABL_Wh_Sum_akt);
    debug_printf("* MQTT Topic_out:%s Payload:%s\r\n", varStore.varMQTT_s_TOPIC_OUT, str);
    mqttclient.publish(varStore.varMQTT_s_TOPIC_OUT, str);
   
