raibisch/ESP32_ABL/src/main.cpp
}
#endif // MQTT
         

/// @brief ABL Rx-Timeout after 2 polling periodes
bool testTimeount()
{
        ABL_rx_timeoutcount++;

// DEBUG: Simulate status        
#ifdef DEBUG_WITHOUT_ABL
#pragma message("Info : DEBUG_WITHOUT_ABL=1")
        //ABL_rx_Ipwm = 16;
        ABL_rx_Ipwm = 10;
        debug_printf("ABL_rx_timeoutcount:%d\r\n", ABL_rx_timeoutcount);

        AsyncWebLog.println("ABL_rx_timeoutcount:");
        AsyncWebLog.println(String(ABL_rx_timeoutcount));
        
        if (ABL_rx_timeoutcount < 2)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_A1];
        }
        else
        if (ABL_rx_timeoutcount < 3)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_C2];
        }
        else
        if (ABL_rx_timeoutcount < 4)
        {
          ABL_rx_status = "?";
        } 
        else
        if (ABL_rx_timeoutcount < 8)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_C2];
        } 
        else
        if (ABL_rx_timeoutcount < 9)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_B2];
        }
        else
        if (ABL_rx_timeoutcount < 10)
        {
          ABL_rx_status = "?";
        }
        else
        if(ABL_rx_timeoutcount < 11)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_A1];
        }
        else
        if(ABL_rx_timeoutcount < 12)
        {
          ABL_rx_status = "F1"; // simulate Error Message
        }
        else
        {
          ABL_rx_timeoutcount = 0;
          ABL_rx_status = ABL_STATUS_STRING[ABL_B1];
        }
        return false;
#else
        if (ABL_rx_timeoutcount > 2)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_TIMEOUT];
          return true;
        }
        return false;
#endif
}

// ---- EEPROM Simulation to save Values over Reset and Poweroff-------
Preferences hist;

void initHistory()
{
   hist.begin("history", false); // use history
   ABL_Wh_Sum_old = hist.getULong64("whsum",0);
   ABL_Wh_Sum_akt = ABL_Wh_Sum_old;
   debug_printf("restored ABL_Wh_Sum_old= %d\r\n",ABL_Wh_Sum_old);
   SYS_RestartCount = hist.getInt("restart",0);
   SYS_TimeoutCount = hist.getInt("timeout",0);
   SYS_ChargeCount =  hist.getInt("charge",0);
   debug_printf("restored = %d\r\n",SYS_RestartCount);
}


bool set_Wh_Sum(unsigned long whs)
{
  hist.putULong64("whsum", whs);
  return true;
}


bool saveHistory()
{
   ABL_Wh_Sum_old = ABL_Wh_Sum_akt;
   debug_printf("ABL_Wh_Sum_akt:%d\r\n",ABL_Wh_Sum_akt)
   hist.putULong64("whsum",ABL_Wh_Sum_akt);
   hist.putUInt("restart", SYS_RestartCount);
   hist.putUInt("timeout", SYS_TimeoutCount);
   return true;
}
// ----  END EPROM Simulation -----------------------------------------

//////////////////////////////////////////////////////////
static double Wh = 0;
/// @brief calculate aktual an total (sum) of W/h
/// @param polltime_ms 
/// @return 
/////////////////////////////////////////////////////////
void calculate_kWh()
{
   if (ABL_rx_status.startsWith("?")) // no calulation at unvalid data
   {
    return;
   }

   if (ABL_rx_status.startsWith("no")) // no calulation at timeout
   {
    return;
   }

   if (ABL_rx_status_old != ABL_rx_status) // Status is changing
   {
    // end charging
    if (ABL_rx_status_old.startsWith("C"))
    {
      saveHistory();
      hist.putInt("charge",SYS_ChargeCount++);
    }
    
    // start charging
    if (ABL_rx_status.startsWith("C"))
    {
      saveHistory();
      rtc.setTime(1);
      ABL_PollTime_old = 1;
      ABL_rx_Isum = 0;
      ABL_rx_kW = 0;
    }
    else
    // End of Charging  by JG 24.3.2024 set kw=0 at
    if (ABL_rx_status.startsWith("B"))
    {
      ABL_rx_kW = 0;
    }
    else 
    if (ABL_rx_status.startsWith("A"))
    {
      saveHistory();
      ABL_rx_Isum = 0;
      ABL_rx_kW = 0;
      ABL_rx_Wh = 0;
      ABL_sChargeTime = "        ";
    }
    ABL_rx_status_old = ABL_rx_status;
   } // End Status is changing

   if (ABL_rx_status.startsWith("C")) // is charging
   {
      if ( ABL_rx_Isum == 0) // virtual I-values: calculation with Watt Values from config-values
      {
           switch (ABL_rx_Ipwm)
           { 
            case 6:
            ABL_rx_kW = varStore.varABL_i_Watt_06A / 1000.0;
           break; 

           case 8:
            ABL_rx_kW = varStore.varABL_i_Watt_08A / 1000.0;
           break; 

          case 10:
            ABL_rx_kW = varStore.varABL_i_Watt_10A / 1000.0;
            break;  

           case 12:
            ABL_rx_kW = varStore.varABL_i_Watt_12A / 1000.0;
           break;

           case 16:
             ABL_rx_kW = varStore.varABL_i_Watt_16A / 1000.0;
           break;

           default: // use standard for all other values ... or... expand your code ;-)
            ABL_rx_kW = (230*2*ABL_rx_Ipwm) / 1000.0;
           break;
           }
      }
      else // real I-values from ABL
      { 
          ABL_rx_kW = uint32_t(ABL_rx_Isum*varStore.varABL_i_U_netz) / 1000.0;
      }
      
      ABL_sChargeTime = rtc.getTime();
      Wh = (ABL_rx_kW * (rtc.getEpoch()*1000)) / (double)3600.0;

      ABL_rx_Wh = round(Wh);  
      debug_printf("W/h:%d\r\n", ABL_rx_Wh);
      ABL_Wh_Sum_akt = ABL_Wh_Sum_old + ABL_rx_Wh;
    
  } 
}


/// @brief Init ABL communication over RS485
void ABL_init()
{
    debug_printf("ABL_init: parameters: ABL_RXD_GPIO=%d, ABL_TXT_GPIO=%d, ABL_RX_LOW_ENABLE_GPIO=%d\r\n", ABL_RXD_GPIO, ABL_TXT_GPIO, ABL_RX_LOW_ENABLE_GPIO);
    debug_println("ABL_init: start to initialize...");
    Serial_ABL.begin(38400, SERIAL_8E1, ABL_RXD_GPIO, ABL_TXT_GPIO);
    ABL_rx_String="";
    //ABL_rx_String.reserve(200);
    pinMode(ABL_RX_LOW_ENABLE_GPIO, OUTPUT_OPEN_DRAIN);
    digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0);
    delay(1);
    //Serial_ABL.flush();
    debug_println("ABL_init: check serial connection...");
    while(Serial_ABL.available())
    {
        Serial_ABL.read();
    }
    debug_println("ABL_init: OK!");
}

/// @brief Send to ABL
/// @param s 
void ABL_Send(ABL_POLL_STATUS s)
{
 String tx = "";

 switch (s)
 {
  case POLL_Current:
    tx = String(ABL_TX_POLL_MESSAGE);
  break;

  case SET_Current:
    ABL_PauseFlag = false;
    switch (ABL_tx_Icmax)
    {
      case 0:
        ABL_PauseFlag = true;
        tx = String(ABL_TX_SET_DISABLE);
      break;
      
      case 5:
      case 6:
       tx = String(ABL_TX_SET_6A);
      break;

      case 7:
      case 8:
         tx = String(ABL_TX_SET_8A);
      break;

      case 9:
      case 10:
          tx = String(ABL_TX_SET_10A);
      break;

      case 11:
      case 12:
           tx = String(ABL_TX_SET_12A);
      break;

      case 13:
      case 14:
          tx = String(ABL_TX_SET_14A);
      break;

      case 15:
         tx = String(ABL_TX_SET_15A);
      break;

