raibisch/ESP32_ABL/src/main.cpp
      case 16:
          tx = String(ABL_TX_SET_16A);
      break;

      default:
          tx = String(ABL_TX_SET_6A);
      break;
    }
  break; // End Set_Current

  //todo: additional Tx-Commands
  // 
  // ModifyState: Register 0x05
  // Enable:  A1A1
  // Disable: E0E0 
  
  // GetFirmware: Register 0x01
  
  default:
  break;
 } // end of swtich(s) --> ABL_POLL_STATUS

 AsyncWebLog.println("TX" + tx);
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1);
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // Switch from TX to RX
 delay(1000);
 // empty the first rx input because of possible trash after first ABL-wakeup call
 while (Serial_ABL.available()) 
 {
    // cppcheck-suppress unreadVariable
    char inChar = (char)Serial_ABL.read();
 }
 // send 2x for wakeup from sleep
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1); // Switch form Rx to TX
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);

 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // switch from Tx to Rx
}

 /// @brief Parse the received Data from ABL
 /// @param s 
 bool ABL_ParseReceive(String s)
 {
/*
Register 0x002E Read current (full)
   r/w Reg leng, LRC
   r  46d   5
:01 03 002E 0005 C9   

Send: 
:0103002E0005C9
Answer: (Status A1 = not connected)
>01030A2EA1108503E803E803E8CD


                      0=not connected
                      0=not reduced
                      0=EN2 open
                      1=EN1 closes 
      Cnt Reg    State   0001       Imax       Ip1  Ip2  Ip3  LRC
      10                         133dx0.06
                                 = 8A
>01 03 0A 2E      A1     10        85          03E8 03E8 03E8 CD
cnt:               0      1         2          3 4  5 6  7 8 
>01 03 0A 2E      A1     10        64          03E8 03E8 03E8 EE
                                 100dx0.06
                                 =  6A
*/
  bool ret = false;
  if (s.startsWith(">01030A2E") && s.length()>=28 )  // 2E = Read current (full)
  {
       AsyncWebLog.println("Status:" + s.substring(9,11)+ " Ipwm:" + s.substring(13,15) + " I1:" + s.substring(15,19) +  + " I2:" + s.substring(19,23) + " I3:" + s.substring(23,27));  
       ABL_rx_status = s.substring(9,11);
       try
       {
         ABL_rx_Ipwm = (uint16_t)(round(HexString2int(s.substring(12,15)) * (float)0.06));
         uint32_t i1,i2,i3 =0;
        
         i1 = HexString2int(s.substring(15,19));
         if (i1 > 900)
         {i1=0;}

         i2 = HexString2int(s.substring(19,23));
         if (i2 > 900)
         {i2=0;}

         i3 = HexString2int(s.substring(23,27));
         if (i3 > 900)
         {i3=0;}
         
         ABL_rx_Isum = (i1 +i2 + i3) / 10;

         AsyncWebLog.println("Ipwm="+ String(ABL_rx_Ipwm)+  " I="+ String(i1/10.0)+ "+" + String(i2/10.0) +"+" +String(i3/10.0) +"+ Isum="+ String(ABL_rx_Isum)  + "\r\n");
         ret = true;
      
       }
       catch(const std::exception& e)
       {
         ABL_rx_Isum = 0;
         AsyncWebLog.println("*Exeption*");
       }   
  }
  else
  if (s.startsWith(">011000140001DA")) // 14 = set Imax OK (duty cycle)
  {
    // >011000140001DA
    AsyncWebLog.println("*RX Set-Imax OK*");
    ABL_tx_status = POLL_Current;  // next Command
    forcePolling();
  }
  else
  if (s.startsWith(">01"))
  {
     AsyncWebLog.println("*RX-UNKNOWN!:" + s);
  }
  else
  {
    AsyncWebLog.println("*RX-UNVALID!");
    ABL_rx_status = ABL_STATUS_STRING[ABL_UNVALID];
  }

  ABL_rx_String = "";
  return ret;
 }



void serialEventABL() 
{
    while (Serial_ABL.available()) 
    {
     char inChar = (char)Serial_ABL.read();
     ABL_rx_String += inChar;
     if (inChar == '\n') 
     {
      AsyncWebLog.println("RX"+ ABL_rx_String);
      if (ABL_ParseReceive(ABL_rx_String))
      {
        ABL_rx_timeoutcount = 0;
      }
      ABL_rx_String = "";
      delay(1000);
      setLED(0); // LED off
    }
   } // while
}

#ifdef USE_ETH_INSTEAD_WIFI
//////////////////////////////////////////
/// @brief Init Ethernet
/////////////////////////////////////////
void initEthernet()
{
    debug_print("Starting ETH interface...");
    ETH.begin();
    delay(200);
    ETH.setHostname(varStore.varDEVICE_s_Name.c_str());

    debug_print("ETH MAC: ");
    debug_print(ETH.macAddress());
    debug_print("IP Address: ");
    debug_print(ETH.localIP());
    SYS_IP = ETH.localIP().toString();
    return;
}

//////////////////////////////////////////
/// @brief Manage the Wifi Connection
/////////////////////////////////////////
void handleEthernetConnection() 
{
}
#endif // USE_ETH_INSTEAD_WIFI

//////////////////////////////////////////
/// @brief Init Wifi
/////////////////////////////////////////
void initWifi(bool bSetAP)
{
  // Test mit AP !!!!!!!!!!!!!!!!!!!!!
  //varStore.varWIFI_s_Mode="AP";
  // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  // API Info: https://docs.espressif.com/projects/esp-idf/en/v4.4.6/esp32/api-reference/network/esp_wifi.html
   if (bSetAP || (varStore.varWIFI_s_Mode == "AP"))
   {
    delay(100);
    debug_println("INFO-WIFI:AP-Mode");
    WiFi.softAP("ESP_ABL_AP");   
    debug_print("IP Address: ");
    SYS_IP = WiFi.softAPIP().toString();
    debug_println(SYS_IP);
   }
   else
   {
    debug_printf("INFO-WIFI:STA-Mode\r\n");
    WiFi.mode(WIFI_STA);
   
    WiFi.setHostname(varStore.varDEVICE_s_Name.c_str());
    WiFi.begin(varStore.varWIFI_s_SSID.c_str(), varStore.varWIFI_s_Password.c_str());
    int i = 0;
    delay(500);
    debug_printf("SSID:%s\r\n", varStore.varWIFI_s_SSID);
    ///debug_printf("Passwort:%s\r\n", varStore.varWIFI_s_Password);
    while ((WiFi.waitForConnectResult() != WL_CONNECTED) && (i < 5))
    {
        debug_printf(".");
        setLED(i%2);
        i++;  
        delay(300);
    }
    delay(300);
    if (WiFi.waitForConnectResult() == WL_CONNECTED)
    {
      debug_printf("Get WiFi-Power:%d\r\n",WiFi.getTxPower())
      debug_printf("Get WiFi-RSSI:%d\r\n",WiFi.RSSI());
      
      debug_print("IP Address: ");
      SYS_IP = WiFi.localIP().toString();
      debug_println(SYS_IP);
      return;
    }
    else
    {
      ESP.restart();
    }
   }

  return;
}

//////////////////////////////////////////
/// @brief Manage the Wifi Connection
/////////////////////////////////////////
void handleWifiConnection() 
{
    // Test if wifi is lost from router
    if ((varStore.varWIFI_s_Mode == "STA") && (WiFi.status() != WL_CONNECTED))
    {
        delay(1000);
        //saveHistory();
        hist.putInt("restart",SYS_RestartCount++);
        delay(200);
        ESP.restart();
    }
}

static String readString(File s) 
{
  String ret;
  int c = s.read();
  while (c >= 0) {
    ret += (char)c;
    c = s.read();
  }
  return ret;
}

int getIntStatus()
{
   long intValue = strtol(ABL_rx_status.c_str(), NULL, 16);
   return intValue;
}


// -------------------- WEBSERVER ----------------------------------------------
// -----------------------------------------------------------------------------
//


/// @brief replace placeholder "%<variable>%" in HTML-Code
/// @param var 
/// @return String
String setHtmlVar(const String& var)
{
  debug_print("func:setHtmlVar: ");
  debug_println(var);
 
  if (var == "CONFIG") // read config.txt
  {
    if (!SPIFFS.exists("/config.txt")) 
    {
     return String(F("Error: File 'config.txt' not found!"));
    }
    // read "config.txt" 
    fs::File configfile = SPIFFS.open("/config.txt", "r");   
    String sConfig;     
    if (configfile) 
    {
      sConfig = readString(configfile);
      configfile.close();
    }
    else 
    { // no "config.txt"
      sConfig = "";
    }
    return sConfig;
  } 
  else
  if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_Name;
  }
  if (var== "I-HIGH")
  {
    return "I-HIGH(" + String(varStore.varABL_i_A_soll_high) + "A)";
  }
  else
   if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_Name;
  }
  else
  if (var== "I-LOW")
  {
    return "I-LOW(" + String(varStore.varABL_i_A_soll_low) + "A)";
  }
  else
  if (var == "KWHSUM")
  {
    float f = 0.00;
    if (ABL_Wh_Sum_akt > 0)
    {
      f = ABL_Wh_Sum_akt / 1000.00;
    }
    return String(f);
  } 
  else
  if (var == "INFO")
  {
#ifndef WITHOUT_TEMP
    temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
    temp_sensor.dac_offset = TSENS_DAC_L2;  // TSENS_DAC_L2 is default; L4(-40°C ~ 20°C), L2(-10°C ~ 80°C), L1(20°C ~ 100°C), L0(50°C ~ 125°C)
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
    float temp_celsius = 0;
    temp_sensor_read_celsius(&temp_celsius);
    String temp = String(temp_celsius);
#else
    String temp = "(unknown)";
#endif // WITHOUT_TEMP
  
