raibisch/ESP32_ABL/src/main.cpp
     return "Version    :"   + SYS_Version + 
            "\nBuild      :" + SYS_CompileTime + 
            "\nTemp(C)    :" + temp +
            "\nIP-Addr    :" + SYS_IP +
            "\nTimeout-Cnt:" + SYS_TimeoutCount + 
            "\nCharge-Cnt :" + SYS_ChargeCount + 
            "\nRestart-Cnt:" + String(SYS_RestartCount) + 
            "\nRSSI       :" + String(WiFi.RSSI()) + 
            "\nIpwm       :" + String(ABL_rx_Ipwm) + 
            "\nStatus     :" + ABL_rx_status;
  }
  else
  if (var == "IMAX")
  {
     return String(ABL_tx_Icmax);
  }
     

  return String();
}

void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}

// for "/" and "/index" handle post
void Handle_Index_Post(AsyncWebServerRequest *request)
{
   debug_println("Argument: " + request->argName(0));
   debug_println("Value: ");
   //uint8_t i = 0;
   //String s  = request->arg(i);
   //debug_println(s);
   //String sRet = "";
   if (request->argName(0) == "ihigh")
   {
     //ABL_Send("high");
     forcePolling();
     ABL_tx_Icmax = varStore.varABL_i_A_soll_high;
     ABL_tx_status = SET_Current;
   }
   else
   if (request->argName(0) == "ilow")
   {
       //sRet = ABL_Send("low");
       forcePolling();
       ABL_tx_Icmax = (int)varStore.varABL_i_A_soll_low;
       ABL_tx_status = SET_Current;
   }
   else
   if (request->argName(0) == "pause")
   {
       //sRet = ABL_Send("low");
       forcePolling();
       ABL_tx_Icmax = 0;
       ABL_tx_status = SET_Current;
      AsyncWebLog.println("CHARGE-PAUSE");

    }

   AsyncWebLog.println("SET-Current:" + String(ABL_tx_Icmax) + "A");
   forcePolling();
   request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
}

void initWebServer()
{ 
  debug_print("Init web server...\n");
    //Route for root / web page
  server.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    if (bInitFileOK) 
    { 
      request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
    }
    else
    { // "rescue page" for first run without valid Wifi-credentials or no valid data-system
      request->redirect("/ota_ap.html");
      //request->send(202, "text/plain", "goto: http://192.168.4.1/ota_ap.html");
    }
  });

   
  // Notfall Website 'ota_ap.html' für Software-Upload
  static const char* staticOTA_site PROGMEM = R"(
<!DOCTYPE HTML><html lang="de"><head>
<title>OTA-Update</title><meta charset="UTF-8"></head>
<body><form method='POST' action='/ota_update' enctype='multipart/form-data'></p><div>Select a file 'myFS.bin' (myFS-Data) or 'firmware.bin' (Program)</div><input class='container' type='file' name='update' accept='.bin'><input type='submit' name="startupdate" value='START-UPLOAD'><BR></form>
</p><a class="buttonlink" href="reboot.html">REBOOT!</a>
</body></html>
)";
  server.on("/ota_ap.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(200, "text/html", staticOTA_site);
  });


  //Route for root /index web page
  server.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
  });

  

  // > Version V1.2
  //Route for stored values
  server.on("/setcurrent.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setcurrent.html", String(), false, setHtmlVar);
  });

  

  //Route for setup web page
  server.on("/setup.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setup.html", String(), false, setHtmlVar);
  });


  //Route for config web page
  server.on("/config.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });

  
  //Route for stored values
  server.on("/setvalues.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setvalues.html", String(), false, setHtmlVar);
  });

  // > Version V1.2
  //Route for Info-page
  server.on("/info.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/info.html", String(), false, setHtmlVar);
  });
  

  // Route for style-sheet
  server.on("/style.css",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/style.css", String(), false);
  });


  // fetch GET
  server.on("/fetch", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    
    // fetch is also used for setting Imax with URL-Variable
    // example: 
    // http://<your-ip>/fetch?imax=8 --> set Imax to 8A
    //
    // valid values: imax=0..6..8..10..12..14..15..16 
    // specal case imax=0 --> Pause charging
    if (request->args() > 0)
    {
    debug_println("GET-Argument: " + request->argName(0));
    debug_print("Value: ");
    uint8_t i = 0;
    String s  = request->arg(i);
    debug_println(s);
    if (request->argName(0) == "imax")
    {
       forcePolling();
       uint a = String(request->arg(i)).toInt();
       AsyncWebLog.println("GET-SET-Imax:" + String(a)+ "A");
       if ((a >=6 && a <=16) || (a==0))
       {
           ABL_tx_Icmax = a;
           ABL_tx_status = SET_Current; // next Send Protocol
       }
       else
       {
        AsyncWebLog.println("**ERROR Imax out of range!");
       }
    }
    }
    
    if (ABL_PauseFlag)
    {
      ABL_rx_status = ABL_STATUS_STRING[ABL_PAUSE];
    }
    // return actual values
    // REMARK: if you change Imax it needs one more GET to return the actual value of Imax
    String s = String(ABL_rx_Ipwm)+',' + String(ABL_rx_kW) + ','+ ABL_rx_status+ ',' + String(ABL_rx_Wh/1000.0) + ',' + String(ABL_Wh_Sum_akt) + ',' +String(ABL_sChargeTime);
    request->send(200, "text/plain", s);
    //debug_println("server.on /fetch: "+ s);
  });


   // fetch GET
  server.on("/fetchjson", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    // return actual values
    // REMARK: if you change Imax it needs one more GET to return the actual value of Imax
    String s = "{\"ipwm\": "      + String(ABL_rx_Ipwm)+ ", "+ 
                 "\"kw\": "       + String(ABL_rx_kW)  + ", "+ 
                 "\"status\": \"" + ABL_rx_status      + "\", "+ 
                 "\"wh\": "       + String(ABL_rx_Wh/1000.0) + ", " + 
                 "\"whsum\": "    + String(ABL_Wh_Sum_akt)   + ", " + 
                 "\"ctime\": \""  + String(ABL_sChargeTime) + "\"}\r\n";
    request->send(200, "text/json", s);
    //debug_println("server.on /fetch: "+ s);
  });

