raibisch/ESP32_ABL/src/main.cpp
  // fetch GET
  server.on("/fetchkv", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    String s = "Imax=" + String(ABL_rx_Ipwm) + " A \n" + 
               "ActPower=" + String(ABL_rx_kW) + " kW\n" +
               "Status=" + String(ABL_rx_status) + "\n" +
               "IntStatus=" + String(getIntStatus()) + "\n" +
               "ActWork=" + String(ABL_rx_Wh/1000.0) + " kW/h\n" +
               "SumWork=" + String(ABL_Wh_Sum_akt) + " W/h\n" +
               "ChargeTime=" + String(ABL_sChargeTime) + "\n";
    request->send(200, "text/plain", s);
  });


    
  // config.txt GET
  server.on("/config.txt", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(SPIFFS, "/config.txt", "text/html", false);
  });

  
  // config.txt GET
  server.on("/reboot.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(404, "text/plain", "RESTART !");
    saveHistory();
    ESP.restart();
  });

  //.. some code for the navigation icons
  server.on("/home.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/home.png", String(), false);
  });

  server.on("/file-list.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/file-list.png", String(), false);
  });
  server.on("/settings.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/settings.png", String(), false);
  });
  server.on("/current.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/current.png", String(), false);
  });

  // ...a lot of code only for icons and favicons ;-))
  server.on("/manifest.json",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/manifest.json", String(), false);
  });
  server.on("/favicon.ico",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/favicon.ico", String(), false);
  });
  server.on("/apple-touch-icon.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/apple-touch-icon.png", String(), false);
  });
  server.on("/android-chrome-192x192.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-192x192.png", String(), false);
  });
  server.on("/android-chrome-384x384.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-384x384.png", String(), false);
  });

  // ------------ POSTs --------------------------------------------------------------------------
  // root (/) POST
  server.on("/",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });

  // index.html POST
  server.on("/index.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });
  
  // > Version V1.2 set current in extra page
  // index.html POST
  server.on("/setcurrent.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });
  
  
  // config.html POST
  server.on("/config.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   //debug_println("Argument: " + request->argName(0));
   //debug_println("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println(s);
   if (request->argName(0) == "saveconfig")
   {
       varStore.Save(s);
       varStore.Load();
   }
   //debug_println("Request /index3.html");
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });
  
  
  // setvalues.html POST
  server.on("/setvalues.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   debug_println("Argument: " + request->argName(0));
   debug_print("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println(s);
   if (request->argName(0) == "kwh") // kW/h Sum
   {
      ABL_Wh_Sum_akt = u_long(s.toFloat()*1000);
      debug_print("ABL_Wh_Sum_akt: ");
      debug_println(ABL_Wh_Sum_akt);
      set_Wh_Sum(ABL_Wh_Sum_akt);
      ABL_Wh_Sum_old = ABL_Wh_Sum_akt;
      saveHistory();
   }    
   request->send(SPIFFS, "/setvalues.html", String(), false, setHtmlVar);
  });
  
  

   /*
   // Send a GET request to <IP>/get?message=<message>
  server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request) {
        String message;
        if (request->hasParam(PARAM_MESSAGE)) {
            message = request->getParam(PARAM_MESSAGE)->value();
        } else  // Serious problem{
            message = "No message sent";
        }
        request->send(200, "text/plain", "Return Value from GET: " + message);
  });

  // Send a POST request to <IP>/post with a form field message set to <message>
  server.on("/post", HTTP_POST, [](AsyncWebServerRequest *request){
        String message;
        if (request->hasParam(PARAM_MESSAGE, true)) {
            message = request->getParam(PARAM_MESSAGE, true)->value();
        } else {
            message = "No message sent";
        }
        request->send(200, "text/plain", "Hello, POST: " + message);
  });
  */

  
  server.onNotFound(notFound);

  AsyncWebLog.begin(&server);
  AsyncWebOTA.begin(&server);
  server.begin();
}


void initSPIFFS()
{
  if (!SPIFFS.begin())
  {
   debug_println("*** ERROR: SPIFFS Mount failed");
  } 
  else
  {
   debug_println("* INFO: SPIFFS Mount succesfull");
  }
}


// ------------------((ABL_rx_status.startsWith("C")) && --------------------------
void setup()
{
  delay(800);
  debug_begin(115200);  
  delay(800);
  debug_println("Setup-Start");
  initSPIFFS();
#ifndef WITHOUT_LED
  initLED();
#endif
  initFileVarStore();
  initHistory();
  delay(200);
#ifdef USE_ETH_INSTEAD_WIFI
  initEthernet();
#else
  initWifi(!bInitFileOK);
#endif
  delay(200);
#ifdef MQTT_ENABLE
  mqtt_setup();
#endif  
  initWebServer();
  ABL_init();
  delay(400);
  forcePolling();
  rtc.setTime(0);
}


time_t charge_time;
int log_timer = 0;
unsigned long tmp_poll_time_ms = 10000;
String s;
int iBlink;

void loop()
{
    if (ABL_rx_status.startsWith("C"))
    { tmp_poll_time_ms = 10000;}  // while charging 10sec polling.
    else
    { tmp_poll_time_ms = varStore.varABL_i_Scantime_ms;} // value > 30sec reduces standby power 

    if (millis() - tmp_poll_time_ms > ABL_PollTime_old)
    {
       ABL_PollTime_old  = millis();
       log_timer = tmp_poll_time_ms / 1000;
       //setLED(1);
       ABL_Send(ABL_tx_status);
       testTimeount(); 
    }
    else
    {
        serialEventABL();
    }

    if (millis() - varStore.varABL_i_logtime_ms > ABL_StatusSec_old)
    {
      setLED(iBlink%2);
      iBlink++;
      ABL_StatusSec_old = millis();
      log_timer--;
      calculate_kWh();
      if (ABL_rx_status.startsWith("C"))
      { 
        s = ABL_sChargeTime + " Wh-akt:" + ABL_rx_Wh + " next Tx in:" + log_timer + "sec";
      }
      else
      {
        s = "Next Tx in :" + String(log_timer) + "sec";
      }
      AsyncWebLog.println(s);

#ifdef USE_ETH_INSTEAD_WIFI
      handleEthernetConnection();
#else
      handleWifiConnection();
#endif
    }

#ifdef MQTT_ENABLE
    mqtt_loop();
#endif              
}

